app/controllers/authentication_controller.rb

  def login
    command = AuthenticateUser.call(params[:email], params[:password])

    if command.success?
      render json: { "data" => { "auth_token": command.result }, "status": "ok" }, status: status
    else
      render json: { message: command.errors[:user_authentication].first, status: "error" }, status: :unauthorized
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "any@mobex.md"], ["LIMIT", 1]]