app/controllers/jogs_controller.rb

  def index
    if(params.has_key?(:start_date) && params.has_key?(:end_date))
      filter = params[:start_date]..params[:end_date]
      @jogs = Jog.where(:user_id => params[:user_id]).where(:date => filter)
    else
      @jogs = Jog.where(:user_id => params[:user_id])
---
SELECT "jogs".* FROM "jogs" WHERE "jogs"."user_id" = $1  [["user_id", 8]]

  def show
    @jog = Jog.find(params[:id])
---
SELECT  "jogs".* FROM "jogs" WHERE "jogs"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

  def update
    @jog = Jog.find(params[:id])
    @jog.update(jog_params)
---
SELECT  "jogs".* FROM "jogs" WHERE "jogs"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "jogs" SET "distance" = $1, "updated_at" = $2 WHERE "jogs"."id" = $3  [["distance", 10], ["updated_at", "2017-09-08 12:30:54.528958"], ["id", 12]]

  def destroy
    @jog = Jog.find(params[:id])
    @jog.destroy
---
SELECT  "jogs".* FROM "jogs" WHERE "jogs"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
DELETE FROM "jogs" WHERE "jogs"."id" = $1  [["id", 17]]