app/controllers/users_controller.rb

INSERT INTO "users" ("email", "name", "created_at", "updated_at", "password_digest", "role") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
     @user = User.create!(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 137], ["LIMIT", 1]]
UPDATE "users" SET "role" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["role", "admin"], ["updated_at", "2017-09-08 12:30:55.556268"], ["id", 143]]
---
  def update_role
    @user = User.find(params[:id])
    @user.update(update_user_role_params)